java/44/nfsesvc/src/main/resources/templates/SOAP-env-cancelar.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://www.abrasf.org.br/nfse.xsd">
  <soapenv:Header/>
  <soapenv:Body>
    <nfse:CancelarNfseEnvio>
      <Pedido>
        <InfPedidoCancelamento>
          <IdentificacaoNfse>
            <Numero>${numeroNfse}</Numero>
          </IdentificacaoNfse>
          <CodigoCancelamento>${motivo}</CodigoCancelamento>
        </InfPedidoCancelamento>
      </Pedido>
    </nfse:CancelarNfseEnvio>
  </soapenv:Body>
</soapenv:Envelope>
